## Plan Result (notes-api-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11939071737)



<pre><code>Plan: 13 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511
  * aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2
  * aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
  * aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED
  * aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1
  * aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0
  * aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247
  * aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_rds_cluster.rds_rds_cluster_1A0399FD
  * aws_rds_cluster_instance.rds_rds-instance_6675FA88
  * aws_secretsmanager_secret.rds_rds_secret_A0401B27
  * aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_in_policy_BF273511" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "NotesAPI-Prod-ScaleInPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/NotesAPI-Prod/NotesAPI-Prod"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_out_policy_D03900A2" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "NotesAPI-Prod-ScaleOutPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/NotesAPI-Prod/NotesAPI-Prod"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 2
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99 will be created
  + resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 2
      + resource_id        = "service/NotesAPI-Prod/NotesAPI-Prod"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
    }

  # aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED will be created
  + resource "aws_cloudwatch_dashboard" "application_cloudwatch-dashboard_1F3DC0ED" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "HTTPCode_Target_4XX_Count",
                                  + "LoadBalancer",
                                  + "app/NOTES2024112017555011100000000e/72be9433890dd178",
                                  + {
                                      + color = "#ff7f0e"
                                      + yAxis = "left"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "RequestCount",
                                  + ".",
                                  + ".",
                                  + {
                                      + color = "#1f77b4"
                                      + yAxis = "right"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "HTTPCode_Target_5XX_Count",
                                  + ".",
                                  + ".",
                                  + {
                                      + color = "#d62728"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "HTTPCode_Target_2XX_Count",
                                  + ".",
                                  + ".",
                                  + {
                                      + color = "#2ca02c"
                                      + yAxis = "right"
                                    },
                                ],
                            ]
                          + period  = 60
                          + region  = "us-east-1"
                          + stacked = false
                          + stat    = "Sum"
                          + title   = "Target Requests"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "HTTPCode_ELB_4XX_Count",
                                  + "LoadBalancer",
                                  + "app/NOTES2024112017555011100000000e/72be9433890dd178",
                                  + {
                                      + color = "#ff7f0e"
                                      + yAxis = "left"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "RequestCount",
                                  + ".",
                                  + ".",
                                  + {
                                      + color = "#1f77b4"
                                      + yAxis = "right"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "HTTPCode_ELB_5XX_Count",
                                  + ".",
                                  + ".",
                                  + {
                                      + color = "#d62728"
                                    },
                                ],
                            ]
                          + period  = 60
                          + region  = "us-east-1"
                          + stacked = false
                          + stat    = "Sum"
                          + title   = "ALB Requests"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "TargetResponseTime",
                                  + "LoadBalancer",
                                  + "app/NOTES2024112017555011100000000e/72be9433890dd178",
                                  + {
                                      + color = "#aec7e8"
                                      + label = "Average"
                                    },
                                ],
                              + [
                                  + "...",
                                  + {
                                      + color = "#ffbb78"
                                      + label = "p95"
                                      + stat  = "p95"
                                    },
                                ],
                              + [
                                  + "...",
                                  + {
                                      + color = "#98df8a"
                                      + label = "p99"
                                      + stat  = "p99"
                                    },
                                ],
                            ]
                          + period  = 60
                          + region  = "us-east-1"
                          + stacked = false
                          + stat    = "Average"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 6
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + annotations = {
                              + horizontal = [
                                  + {
                                      + color = "#e377c2"
                                      + label = "CPU scale out"
                                      + value = 45
                                    },
                                  + {
                                      + color = "#c5b0d5"
                                      + label = "CPU scale in"
                                      + value = 30
                                    },
                                ]
                            }
                          + metrics     = [
                              + [
                                  + "ECS/ContainerInsights",
                                  + "RunningTaskCount",
                                  + "ServiceName",
                                  + "NotesAPI-Prod",
                                  + "ClusterName",
                                  + "NotesAPI-Prod",
                                  + {
                                      + color = "#c49c94"
                                      + yAxis = "right"
                                    },
                                ],
                              + [
                                  + "AWS/ECS",
                                  + "CPUUtilization",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + color = "#f7b6d2"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "MemoryUtilization",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + color = "#c7c7c7"
                                    },
                                ],
                            ]
                          + period      = 60
                          + region      = "us-east-1"
                          + stacked     = false
                          + stat        = "Average"
                          + title       = "Service Load"
                          + view        = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 6
                    },
                ]
            }
        )
      + dashboard_name = "NotesAPI-Prod"
      + id             = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1 will be created
  + resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_in_alarm_850BE3A1" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm to reduce capacity if container CPU is low"
      + alarm_name                            = "NotesAPI-Prod Service Low CPU"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "NotesAPI-Prod"
          + "ServiceName" = "NotesAPI-Prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags                                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
      + tags_all                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
      + threshold                             = 30
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0 will be created
  + resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_out_alarm_E40FCBA0" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm to add capacity if container CPU is high"
      + alarm_name                            = "NotesAPI-Prod Service High CPU"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "NotesAPI-Prod"
          + "ServiceName" = "NotesAPI-Prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags                                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
      + tags_all                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
      + threshold                             = 45
      + treat_missing_data                    = "notBreaching"
    }

  # aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247 will be created
  + resource "aws_codedeploy_deployment_group" "application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247" {
      + app_name                    = "NotesAPI-Prod-ECS"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.ECSAllAtOnce"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "NotesAPI-Prod-ECS"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + service_role_arn            = "arn:aws:iam::996905175585:role/NotesAPI-Prod-ECSCodeDeployRole"
      + tags                        = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
      + tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
      + termination_hook_enabled    = false

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout = "CONTINUE_DEPLOYMENT"
            }
          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 5
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + ecs_service {
          + cluster_name = "NotesAPI-Prod"
          + service_name = "NotesAPI-Prod"
        }

      + load_balancer_info {
          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = [
                      + "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/NOTES2024112017555011100000000e/72be9433890dd178/6ebef8f5401c47db",
                    ]
                }
              + target_group {
                  + name = "NOTESb20241120175547971800000007"
                }
              + target_group {
                  + name = "NOTESg20241120175547936300000006"
                }
            }
        }
    }

  # aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4 will be created
  + resource "aws_ecs_service" "application_ecs_service_ecs-service_A8BAB5F4" {
      + cluster                            = "arn:aws:ecs:us-east-1:996905175585:cluster/NotesAPI-Prod"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "NotesAPI-Prod"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
      + tags_all                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "CODE_DEPLOY"
        }

      + load_balancer {
          + container_name   = "app"
          + container_port   = 4032
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/NOTESb20241120175547971800000007/480299053d43c864"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-003f700f738dafcf3",
            ]
          + subnets          = [
              + "subnet-610bdb3b",
              + "subnet-b2a036fa",
              + "subnet-cc66bde0",
              + "subnet-d09eb8ec",
            ]
        }
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 will be created
  + resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::996905175585:role/NotesAPI-Prod-TaskExecutionRole"
      + family                   = "NotesAPI-Prod"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = true
      + tags                     = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
      + tags_all                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
      + task_role_arn            = "arn:aws:iam::996905175585:role/NotesAPI-Prod-TaskRole"
      + track_latest             = false
    }

  # aws_rds_cluster.rds_rds_cluster_1A0399FD will be created
  + resource "aws_rds_cluster" "rds_rds_cluster_1A0399FD" {
      + allocated_storage                     = (known after apply)
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + availability_zones                    = (known after apply)
      + backup_retention_period               = (known after apply)
      + ca_certificate_identifier             = (known after apply)
      + ca_certificate_valid_till             = (known after apply)
      + cluster_identifier                    = (known after apply)
      + cluster_identifier_prefix             = "notesapi-prod"
      + cluster_members                       = (known after apply)
      + cluster_resource_id                   = (known after apply)
      + copy_tags_to_snapshot                 = true
      + database_name                         = "pocketnotes"
      + db_cluster_parameter_group_name       = (known after apply)
      + db_subnet_group_name                  = "notesapi-prod20241120175546911700000002"
      + db_system_id                          = (known after apply)
      + delete_automated_backups              = true
      + enable_global_write_forwarding        = false
      + enable_http_endpoint                  = false
      + enable_local_write_forwarding         = false
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_lifecycle_support              = (known after apply)
      + engine_mode                           = "provisioned"
      + engine_version                        = "17.1"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_roles                             = (known after apply)
      + id                                    = (known after apply)
      + kms_key_id                            = (known after apply)
      + master_password                       = (sensitive value)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + master_username                       = "pkt_notes"
      + network_type                          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + reader_endpoint                       = (known after apply)
      + skip_final_snapshot                   = false
      + storage_encrypted                     = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
      + tags_all                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
      + vpc_security_group_ids                = [
          + "sg-01bd9130316493458",
        ]

      + serverlessv2_scaling_configuration {
          + max_capacity = 16
          + min_capacity = 1
        }
    }

  # aws_rds_cluster_instance.rds_rds-instance_6675FA88 will be created
  + resource "aws_rds_cluster_instance" "rds_rds-instance_6675FA88" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "17.1"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.serverless"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + promotion_tier                        = 0
      + publicly_accessible                   = (known after apply)
      + storage_encrypted                     = (known after apply)
      + tags_all                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
      + writer                                = (known after apply)
    }

  # aws_secretsmanager_secret.rds_rds_secret_A0401B27 will be created
  + resource "aws_secretsmanager_secret" "rds_rds_secret_A0401B27" {
      + arn                            = (known after apply)
      + description                    = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
      + tags_all                       = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-notesapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "NotesAPI"
        }
    }

  # aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1 will be created
  + resource "aws_secretsmanager_secret_version" "rds_rds_secret_version_11D8C2B1" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecs-task-arn           = (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":965,"Program":"tfcmt","SHA1":"21381c72c4ac0eeb754fb3c1f850ea8e2b9ef9ae","Target":"notes-api-cdk-production","Vars":{},"WorkflowName":"Notes API"} -->